Examinator/src/Catalogs/СерииПинКодовСУО/СерииПинКодовСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерииПинКодовСУО</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДлинаКода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Уведомление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидыПинКодовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонРассылки</name>
    <type>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>АутентификацияВебКабинета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АутентификацияСтандартная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АутентификацияOpenID</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстановитьНастройкиАутентификации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьДоступаВДнях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОпций</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПродолжительностьДоступаВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ГруппыДоступа</name>
    <attributes>
      <name>ГруппаДоступа</name>
      <type>
        <types>CatalogRef.ГруппыДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.ОпцииСерииПинКодовСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Обучение</name>
    <attributes>
      <name>Проведение</name>
      <type>
        <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
        <types>DocumentRef.ПроведениеОбученияСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.ОпцииСерииПинКодовСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УчебныеГруппы</name>
    <attributes>
      <name>УчебнаяГруппа</name>
      <type>
        <types>CatalogRef.УчебныеГруппыСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.ОпцииСерииПинКодовСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппыПользователей</name>
    <attributes>
      <name>ГруппаПользователей</name>
      <type>
        <types>CatalogRef.ГруппыПользователей</types>
      </type>
    </attributes>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.ОпцииСерииПинКодовСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазделыФорума</name>
    <attributes>
      <name>РазделФорума</name>
      <type>
        <types>CatalogRef.РазделыФорумаСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.ОпцииСерииПинКодовСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазделыБиблиотеки</name>
    <attributes>
      <name>РазделБиблиотеки</name>
      <type>
        <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.ОпцииСерииПинКодовСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Новости</name>
    <attributes>
      <name>Новость</name>
      <type>
        <types>DocumentRef.НовостьСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.ОпцииСерииПинКодовСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Рассылка</name>
    <attributes>
      <name>ЭлектронныйАдрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отправлено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоЭлементаСправочникаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/СерииПинКодовСУО/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Устанавливает параметры загрузки.
//
Процедура УстановитьПараметрыЗагрузкиИзФайлаВТЧ(Параметры) Экспорт
	
КонецПроцедуры

// Производит сопоставление данных, загружаемых в табличную часть ПолноеИмяТабличнойЧасти,
// с данными в ИБ, и заполняет параметры АдресТаблицыСопоставления и СписокНеоднозначностей.
//
// Параметры:
//   ПолноеИмяТабличнойЧасти   – Строка – полное имя табличной части, в которую загружаются данные.
//   АдресЗагружаемыхДанных    – Строка – адрес временного хранилища с таблицей значений, в которой
//                                          находятся загруженные данные из файла. Состав колонок:
//     * Идентификатор – Число – порядковый номер строки;
//     * остальные колонки соответствуют колонкам макета ЗагрузкаИзФайла.
//   АдресТаблицыСопоставления – Строка – адрес временного хранилища с пустой таблицей значений,
//                                          являющейся копией табличной части документа, 
//                                        которую необходимо заполнить из таблицы АдресЗагружаемыхДанных.
//   СписокНеоднозначностей – ТаблицаЗначений – список неоднозначных значений, для которых в ИБ имеется несколько подходящих вариантов.
//       * Колонка       – Строка – имя колонки, в которой была обнаружена неоднозначность;
//       * Идентификатор – Число  – идентификатор строки, в которой была обнаружена неоднозначность.
//   ДополнительныеПараметры   – ЛюбойТип – Любые дополнительные сведения.
//
Процедура СопоставитьЗагружаемыеДанные(АдресЗагружаемыхДанных, АдресТаблицыСопоставления, СписокНеоднозначностей, ПолноеИмяТабличнойЧасти, ДополнительныеПараметры) Экспорт
	
	Адресаты =  ПолучитьИзВременногоХранилища(АдресТаблицыСопоставления);
	ЗагружаемыеДанные = ПолучитьИзВременногоХранилища(АдресЗагружаемыхДанных);
	
	Для каждого СтрокаТаблицы Из ЗагружаемыеДанные Цикл
		
		Если Адресаты.Найти(СтрокаТаблицы.ЭлектронныйАдрес, "ЭлектронныйАдрес") = Неопределено Тогда
		
			Адресат = Адресаты.Добавить();
			Адресат.ЭлектронныйАдрес = СтрокаТаблицы.ЭлектронныйАдрес;
			Адресат.Имя              = СтрокаТаблицы.Имя;
			
		КонецЕсли;
			
	КонецЦикла;

	
	ПоместитьВоВременноеХранилище(Адресаты, АдресТаблицыСопоставления);
	
КонецПроцедуры

// Возвращает список подходящих объектов ИБ для неоднозначного значения ячейки.
// 
// Параметры:
//   ПолноеИмяТабличнойЧасти  – Строка – Полное имя табличной части, в которую загружаются данные.
//     ИмяКолонки               – Строка – Имя колонки, в который возникла неоднозначность. 
//  СписокНеоднозначностей    – Массив  – Массив для заполнения с неоднозначными данными.
//  ЗагружаемыеЗначенияСтрока – Строка  – Загружаемые данные, на основании которых возникла неоднозначность.
//  ДополнительныеПараметры   – ЛюбойТип – Любые дополнительные сведения
//
Процедура ЗаполнитьСписокНеоднозначностей(ПолноеИмяТабличнойЧасти, СписокНеоднозначностей, ИмяКолонки, ЗагружаемыеЗначенияСтрока, ДополнительныеПараметры) Экспорт
КонецПроцедуры

Функция ЕстьОпции(Серия) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОпцииСерииПинКодовСУО.Ссылка
		|ИЗ
		|	Справочник.ОпцииСерииПинКодовСУО КАК ОпцииСерииПинКодовСУО
		|ГДЕ
		|	ОпцииСерииПинКодовСУО.Владелец = &Серия
		|	И ОпцииСерииПинКодовСУО.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Серия", Серия);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция НайтиОпциюПоИдентификатору(ИдентификаторОпции) Экспорт
	
	Опция = Справочники.ОпцииСерииПинКодовСУО.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(ИдентификаторОпции) Тогда
	
		Если ТипЗнч(ИдентификаторОпции) = Тип("Строка") Тогда		
			
			Попытка
				Опция = Справочники.ОпцииСерииПинКодовСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторОпции));
			Исключение
				// Не требуется
			КонецПопытки;
				
		КонецЕсли;
		
		Если ТипЗнч(ИдентификаторОпции) = Тип("СправочникСсылка.ОпцииСерииПинКодовСУО") Тогда
			Опция = ИдентификаторОпции;		
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат Опция;
	
КонецФункции

Функция СтруктураОпцийДляВебКабинета(Серия) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СвойстваОпций = Новый Структура();
	СвойстваОпций.Вставить("Наименование", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Серия, "НаименованиеОпций"));				
	СвойстваОпций.Вставить("МногострочноеПолеВвода", Ложь);
	СвойстваОпций.Вставить("ФорматСвойства", "");
	СвойстваОпций.Вставить("Свойство", "pinCodeOption");
	СвойстваОпций.Вставить("Значение", "");
	СвойстваОпций.Вставить("Варианты", Новый Массив);
	СвойстваОпций.Вставить("ТипЗначения", "Свойства");
	СвойстваОпций.Вставить("ТекстоваяСтрока", "");				

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОпцииСерииПинКодовСУО.Наименование,
		|	ОпцииСерииПинКодовСУО.Ссылка
		|ИЗ
		|	Справочник.ОпцииСерииПинКодовСУО КАК ОпцииСерииПинКодовСУО
		|ГДЕ
		|	ОпцииСерииПинКодовСУО.Владелец = &Серия
		|	И ОпцииСерииПинКодовСУО.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Серия", Серия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СвойстваОпций.Варианты.Добавить(
		
			Новый Структура("Значение, Наименование",
				Строка(ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор()),
				ОбщегоНазначенияСУКлиентСервер.JSСтрока(ВыборкаДетальныеЗаписи.Наименование)
			)
		
		);
		
	КонецЦикла;
	
	Возврат СвойстваОпций;
	
КонецФункции

Функция ПродолжительностьДоступаВСекундах(Серия) Экспорт
	ПродолжительностьДоступаВДнях = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Серия, "ПродолжительностьДоступаВДнях");
	Возврат ПродолжительностьДоступаВДнях * 24 * 60 * 60;
КонецФункции

#КонецОбласти

#КонецЕсли
